{"intents": [{"tag": "greeting", "patterns": ["Hello", "Hi", "How are you", "Hi there", "Is anyone there?", "Good day"], "responses": ["Hello, it's my pleasure to help!:)\nYou can ask me questions about excercises or muscles on your body."]}, {"tag": "goodbye", "patterns": ["Bye", "See you later", "Goodbye"], "responses": ["See you later, thanks for visiting!", "Have a nice day!", "Bye! Come back again soon."]}, {"tag": "thanks", "patterns": ["Thanks", "Thank you", "That's helpful", "That's useful", "That helps a lot", "I love you"], "responses": ["Happy to help!", "Any time!", "My pleasure!"]}, {"tag": "noanswer", "patterns": [""], "responses": ["Sorry, can't understand you!", "Not sure I understand!"]}, {"tag": "exercise", "patterns": ["How can I work out my shoulders?", "What's a good shoulders workout?", "What's the best shoulders exercise?", "Show me an exercise for my shoulders", "How do I train my shoulders?", "I'd like to build my shoulders", "What's the best way to get bigger shoulders?", "What's the best way to get stronger shoulders?", "I want to work on my shoulders", "How can I work out my deltoids?", "What's a good deltoids workout?", "What's the best deltoids exercise?", "Show me an exercise for my deltoids", "How do I train my deltoids?", "I'd like to build my deltoids", "What's the best way to get bigger deltoids?", "What's the best way to get stronger deltoids?", "I want to work on my deltoids", "How can I work out my delts?", "What's a good delts workout?", "What's the best delts exercise?", "Show me an exercise for my delts", "How do I train my delts?", "I'd like to build my delts", "What's the best way to get bigger delts?", "What's the best way to get stronger delts?", "I want to work on my delts", "How can I work out my trapezius?", "What's a good trapezius workout?", "What's the best trapezius exercise?", "Show me an exercise for my trapezius", "How do I train my trapezius?", "I'd like to build my trapezius", "What's the best way to get bigger trapezius?", "What's the best way to get stronger trapezius?", "I want to work on my trapezius", "How can I work out my traps?", "What's a good traps workout?", "What's the best traps exercise?", "Show me an exercise for my traps", "How do I train my traps?", "I'd like to build my traps", "What's the best way to get bigger traps?", "What's the best way to get stronger traps?", "I want to work on my traps", "How can I work out my chest?", "What's a good chest workout?", "What's the best chest exercise?", "Show me an exercise for my chest", "How do I train my chest?", "I'd like to build my chest", "What's the best way to get bigger chest?", "What's the best way to get stronger chest?", "I want to work on my chest", "How can I work out my upper body?", "What's a good upper body workout?", "What's the best upper body exercise?", "Show me an exercise for my upper body", "How do I train my upper body?", "I'd like to build my upper body", "What's the best way to get bigger upper body?", "What's the best way to get stronger upper body?", "I want to work on my upper body", "How can I work out my breasts?", "What's a good breasts workout?", "What's the best breasts exercise?", "Show me an exercise for my breasts", "How do I train my breasts?", "I'd like to build my breasts", "What's the best way to get bigger breasts?", "What's the best way to get stronger breasts?", "I want to work on my breasts", "How can I work out my sternum?", "What's a good sternum workout?", "What's the best sternum exercise?", "Show me an exercise for my sternum", "How do I train my sternum?", "I'd like to build my sternum", "What's the best way to get bigger sternum?", "What's the best way to get stronger sternum?", "I want to work on my sternum", "How can I work out my pectorals?", "What's a good pectorals workout?", "What's the best pectorals exercise?", "Show me an exercise for my pectorals", "How do I train my pectorals?", "I'd like to build my pectorals", "What's the best way to get bigger pectorals?", "What's the best way to get stronger pectorals?", "I want to work on my pectorals", "How can I work out my pecs?", "What's a good pecs workout?", "What's the best pecs exercise?", "Show me an exercise for my pecs", "How do I train my pecs?", "I'd like to build my pecs", "What's the best way to get bigger pecs?", "What's the best way to get stronger pecs?", "I want to work on my pecs", "How can I work out my back?", "What's a good back workout?", "What's the best back exercise?", "Show me an exercise for my back", "How do I train my back?", "I'd like to build my back", "What's the best way to get bigger back?", "What's the best way to get stronger back?", "I want to work on my back", "How can I work out my latissimus dorsi?", "What's a good latissimus dorsi workout?", "What's the best latissimus dorsi exercise?", "Show me an exercise for my latissimus dorsi", "How do I train my latissimus dorsi?", "I'd like to build my latissimus dorsi", "What's the best way to get bigger latissimus dorsi?", "What's the best way to get stronger latissimus dorsi?", "I want to work on my latissimus dorsi", "How can I work out my lats?", "What's a good lats workout?", "What's the best lats exercise?", "Show me an exercise for my lats", "How do I train my lats?", "I'd like to build my lats", "What's the best way to get bigger lats?", "What's the best way to get stronger lats?", "I want to work on my lats", "How can I work out my spinal erectors?", "What's a good spinal erectors workout?", "What's the best spinal erectors exercise?", "Show me an exercise for my spinal erectors", "How do I train my spinal erectors?", "I'd like to build my spinal erectors", "What's the best way to get bigger spinal erectors?", "What's the best way to get stronger spinal erectors?", "I want to work on my spinal erectors", "How can I work out my arms?", "What's a good arms workout?", "What's the best arms exercise?", "Show me an exercise for my arms", "How do I train my arms?", "I'd like to build my arms", "What's the best way to get bigger arms?", "What's the best way to get stronger arms?", "I want to work on my arms", "How can I work out my guns?", "What's a good guns workout?", "What's the best guns exercise?", "Show me an exercise for my guns", "How do I train my guns?", "I'd like to build my guns", "What's the best way to get bigger guns?", "What's the best way to get stronger guns?", "I want to work on my guns", "How can I work out my pythons?", "What's a good pythons workout?", "What's the best pythons exercise?", "Show me an exercise for my pythons", "How do I train my pythons?", "I'd like to build my pythons", "What's the best way to get bigger pythons?", "What's the best way to get stronger pythons?", "I want to work on my pythons", "How can I work out my biceps brachii?", "What's a good biceps brachii workout?", "What's the best biceps brachii exercise?", "Show me an exercise for my biceps brachii", "How do I train my biceps brachii?", "I'd like to build my biceps brachii", "What's the best way to get bigger biceps brachii?", "What's the best way to get stronger biceps brachii?", "I want to work on my biceps brachii", "How can I work out my biceps?", "What's a good biceps workout?", "What's the best biceps exercise?", "Show me an exercise for my biceps", "How do I train my biceps?", "I'd like to build my biceps", "What's the best way to get bigger biceps?", "What's the best way to get stronger biceps?", "I want to work on my biceps", "How can I work out my triceps brachii?", "What's a good triceps brachii workout?", "What's the best triceps brachii exercise?", "Show me an exercise for my triceps brachii", "How do I train my triceps brachii?", "I'd like to build my triceps brachii", "What's the best way to get bigger triceps brachii?", "What's the best way to get stronger triceps brachii?", "I want to work on my triceps brachii", "How can I work out my triceps?", "What's a good triceps workout?", "What's the best triceps exercise?", "Show me an exercise for my triceps", "How do I train my triceps?", "I'd like to build my triceps", "What's the best way to get bigger triceps?", "What's the best way to get stronger triceps?", "I want to work on my triceps", "How can I work out my forearms?", "What's a good forearms workout?", "What's the best forearms exercise?", "Show me an exercise for my forearms", "How do I train my forearms?", "I'd like to build my forearms", "What's the best way to get bigger forearms?", "What's the best way to get stronger forearms?", "I want to work on my forearms", "How can I work out my upper legs?", "What's a good upper legs workout?", "What's the best upper legs exercise?", "Show me an exercise for my upper legs", "How do I train my upper legs?", "I'd like to build my upper legs", "What's the best way to get bigger upper legs?", "What's the best way to get stronger upper legs?", "I want to work on my upper legs", "How can I work out my thighs?", "What's a good thighs workout?", "What's the best thighs exercise?", "Show me an exercise for my thighs", "How do I train my thighs?", "I'd like to build my thighs", "What's the best way to get bigger thighs?", "What's the best way to get stronger thighs?", "I want to work on my thighs", "How can I work out my top of leg?", "What's a good top of leg workout?", "What's the best top of leg exercise?", "Show me an exercise for my top of leg", "How do I train my top of leg?", "I'd like to build my top of leg", "What's the best way to get bigger top of leg?", "What's the best way to get stronger top of leg?", "I want to work on my top of leg", "How can I work out my back of legs?", "What's a good back of legs workout?", "What's the best back of legs exercise?", "Show me an exercise for my back of legs", "How do I train my back of legs?", "I'd like to build my back of legs", "What's the best way to get bigger back of legs?", "What's the best way to get stronger back of legs?", "I want to work on my back of legs", "How can I work out my quadriceps?", "What's a good quadriceps workout?", "What's the best quadriceps exercise?", "Show me an exercise for my quadriceps", "How do I train my quadriceps?", "I'd like to build my quadriceps", "What's the best way to get bigger quadriceps?", "What's the best way to get stronger quadriceps?", "I want to work on my quadriceps", "How can I work out my quads?", "What's a good quads workout?", "What's the best quads exercise?", "Show me an exercise for my quads", "How do I train my quads?", "I'd like to build my quads", "What's the best way to get bigger quads?", "What's the best way to get stronger quads?", "I want to work on my quads", "How can I work out my biceps femoris?", "What's a good biceps femoris workout?", "What's the best biceps femoris exercise?", "Show me an exercise for my biceps femoris", "How do I train my biceps femoris?", "I'd like to build my biceps femoris", "What's the best way to get bigger biceps femoris?", "What's the best way to get stronger biceps femoris?", "I want to work on my biceps femoris", "How can I work out my hamstrings?", "What's a good hamstrings workout?", "What's the best hamstrings exercise?", "Show me an exercise for my hamstrings", "How do I train my hamstrings?", "I'd like to build my hamstrings", "What's the best way to get bigger hamstrings?", "What's the best way to get stronger hamstrings?", "I want to work on my hamstrings", "How can I work out my hammies?", "What's a good hammies workout?", "What's the best hammies exercise?", "Show me an exercise for my hammies", "How do I train my hammies?", "I'd like to build my hammies", "What's the best way to get bigger hammies?", "What's the best way to get stronger hammies?", "I want to work on my hammies", "How can I work out my gluteus maximus?", "What's a good gluteus maximus workout?", "What's the best gluteus maximus exercise?", "Show me an exercise for my gluteus maximus", "How do I train my gluteus maximus?", "I'd like to build my gluteus maximus", "What's the best way to get bigger gluteus maximus?", "What's the best way to get stronger gluteus maximus?", "I want to work on my gluteus maximus", "How can I work out my glutes?", "What's a good glutes workout?", "What's the best glutes exercise?", "Show me an exercise for my glutes", "How do I train my glutes?", "I'd like to build my glutes", "What's the best way to get bigger glutes?", "What's the best way to get stronger glutes?", "I want to work on my glutes", "How can I work out my lower legs?", "What's a good lower legs workout?", "What's the best lower legs exercise?", "Show me an exercise for my lower legs", "How do I train my lower legs?", "I'd like to build my lower legs", "What's the best way to get bigger lower legs?", "What's the best way to get stronger lower legs?", "I want to work on my lower legs", "How can I work out my soleus?", "What's a good soleus workout?", "What's the best soleus exercise?", "Show me an exercise for my soleus", "How do I train my soleus?", "I'd like to build my soleus", "What's the best way to get bigger soleus?", "What's the best way to get stronger soleus?", "I want to work on my soleus", "How can I work out my gastrocnemius?", "What's a good gastrocnemius workout?", "What's the best gastrocnemius exercise?", "Show me an exercise for my gastrocnemius", "How do I train my gastrocnemius?", "I'd like to build my gastrocnemius", "What's the best way to get bigger gastrocnemius?", "What's the best way to get stronger gastrocnemius?", "I want to work on my gastrocnemius", "How can I work out my calves?", "What's a good calves workout?", "What's the best calves exercise?", "Show me an exercise for my calves", "How do I train my calves?", "I'd like to build my calves", "What's the best way to get bigger calves?", "What's the best way to get stronger calves?", "I want to work on my calves", "How can I work out my abdomen?", "What's a good abdomen workout?", "What's the best abdomen exercise?", "Show me an exercise for my abdomen", "How do I train my abdomen?", "I'd like to build my abdomen", "What's the best way to get bigger abdomen?", "What's the best way to get stronger abdomen?", "I want to work on my abdomen", "How can I work out my six-pack?", "What's a good six-pack workout?", "What's the best six-pack exercise?", "Show me an exercise for my six-pack", "How do I train my six-pack?", "I'd like to build my six-pack", "What's the best way to get bigger six-pack?", "What's the best way to get stronger six-pack?", "I want to work on my six-pack", "How can I work out my stomach?", "What's a good stomach workout?", "What's the best stomach exercise?", "Show me an exercise for my stomach", "How do I train my stomach?", "I'd like to build my stomach", "What's the best way to get bigger stomach?", "What's the best way to get stronger stomach?", "I want to work on my stomach", "How can I work out my belly?", "What's a good belly workout?", "What's the best belly exercise?", "Show me an exercise for my belly", "How do I train my belly?", "I'd like to build my belly", "What's the best way to get bigger belly?", "What's the best way to get stronger belly?", "I want to work on my belly", "How can I work out my gut?", "What's a good gut workout?", "What's the best gut exercise?", "Show me an exercise for my gut", "How do I train my gut?", "I'd like to build my gut", "What's the best way to get bigger gut?", "What's the best way to get stronger gut?", "I want to work on my gut", "How can I work out my beer belly?", "What's a good beer belly workout?", "What's the best beer belly exercise?", "Show me an exercise for my beer belly", "How do I train my beer belly?", "I'd like to build my beer belly", "What's the best way to get bigger beer belly?", "What's the best way to get stronger beer belly?", "I want to work on my beer belly", "How can I work out my rectus abdominis?", "What's a good rectus abdominis workout?", "What's the best rectus abdominis exercise?", "Show me an exercise for my rectus abdominis", "How do I train my rectus abdominis?", "I'd like to build my rectus abdominis", "What's the best way to get bigger rectus abdominis?", "What's the best way to get stronger rectus abdominis?", "I want to work on my rectus abdominis", "How can I work out my abs?", "What's a good abs workout?", "What's the best abs exercise?", "Show me an exercise for my abs", "How do I train my abs?", "I'd like to build my abs", "What's the best way to get bigger abs?", "What's the best way to get stronger abs?", "I want to work on my abs", "How can I work out my external obliques?", "What's a good external obliques workout?", "What's the best external obliques exercise?", "Show me an exercise for my external obliques", "How do I train my external obliques?", "I'd like to build my external obliques", "What's the best way to get bigger external obliques?", "What's the best way to get stronger external obliques?", "I want to work on my external obliques", "How can I work out my obliques?", "What's a good obliques workout?", "What's the best obliques exercise?", "Show me an exercise for my obliques", "How do I train my obliques?", "I'd like to build my obliques", "What's the best way to get bigger obliques?", "What's the best way to get stronger obliques?", "I want to work on my obliques", "How can I work out my legs?", "What's a good legs workout?", "What's the best legs exercise?", "Show me an exercise for my legs", "How do I train my legs?", "I'd like to build my legs", "What's the best way to get bigger legs?", "What's the best way to get stronger legs?", "I want to work on my legs"], "responses": []}, {"tag": "identification", "patterns": ["Where are the shoulders?", "What are the shoulders?", "How do the shoulders work?", "Where can I find my shoulders?", "Where are the deltoids?", "What are the deltoids?", "How do the deltoids work?", "Where can I find my deltoids?", "Where are the delts?", "What are the delts?", "How do the delts work?", "Where can I find my delts?", "Where are the trapezius?", "What are the trapezius?", "How do the trapezius work?", "Where can I find my trapezius?", "Where are the traps?", "What are the traps?", "How do the traps work?", "Where can I find my traps?", "Where is the chest?", "What's the chest?", "How does the chest work?", "Where can I find my chest?", "Where is the upper body?", "What's the upper body?", "How does the upper body work?", "Where can I find my upper body?", "Where are the breasts?", "What are the breasts?", "How do the breasts work?", "Where can I find my breasts?", "Where is the sternum?", "What's the sternum?", "How does the sternum work?", "Where can I find my sternum?", "Where are the pectorals?", "What are the pectorals?", "How do the pectorals work?", "Where can I find my pectorals?", "Where are the pecs?", "What are the pecs?", "How do the pecs work?", "Where can I find my pecs?", "Where is the back?", "What's the back?", "How does the back work?", "Where can I find my back?", "Where is the latissimus dorsi?", "What's the latissimus dorsi?", "How does the latissimus dorsi work?", "Where can I find my latissimus dorsi?", "Where are the lats?", "What are the lats?", "How do the lats work?", "Where can I find my lats?", "Where are the spinal erectors?", "What are the spinal erectors?", "How do the spinal erectors work?", "Where can I find my spinal erectors?", "Where are the arms?", "What are the arms?", "How do the arms work?", "Where can I find my arms?", "Where are the guns?", "What are the guns?", "How do the guns work?", "Where can I find my guns?", "Where are the pythons?", "What are the pythons?", "How do the pythons work?", "Where can I find my pythons?", "Where is the biceps brachii?", "What's the biceps brachii?", "How does the biceps brachii work?", "Where can I find my biceps brachii?", "Where are the biceps?", "What are the biceps?", "How do the biceps work?", "Where can I find my biceps?", "Where is the triceps brachii?", "What's the triceps brachii?", "How does the triceps brachii work?", "Where can I find my triceps brachii?", "Where are the triceps?", "What are the triceps?", "How do the triceps work?", "Where can I find my triceps?", "Where are the forearms?", "What are the forearms?", "How do the forearms work?", "Where can I find my forearms?", "Where are the upper legs?", "What are the upper legs?", "How do the upper legs work?", "Where can I find my upper legs?", "Where are the thighs?", "What are the thighs?", "How do the thighs work?", "Where can I find my thighs?", "Where is the top of leg?", "What's the top of leg?", "How does the top of leg work?", "Where can I find my top of leg?", "Where are the back of legs?", "What are the back of legs?", "How do the back of legs work?", "Where can I find my back of legs?", "Where are the quadriceps?", "What are the quadriceps?", "How do the quadriceps work?", "Where can I find my quadriceps?", "Where are the quads?", "What are the quads?", "How do the quads work?", "Where can I find my quads?", "Where are the biceps femoris?", "What are the biceps femoris?", "How do the biceps femoris work?", "Where can I find my biceps femoris?", "Where are the hamstrings?", "What are the hamstrings?", "How do the hamstrings work?", "Where can I find my hamstrings?", "Where are the hammies?", "What are the hammies?", "How do the hammies work?", "Where can I find my hammies?", "Where are the gluteus maximus?", "What are the gluteus maximus?", "How do the gluteus maximus work?", "Where can I find my gluteus maximus?", "Where are the glutes?", "What are the glutes?", "How do the glutes work?", "Where can I find my glutes?", "Where are the lower legs?", "What are the lower legs?", "How do the lower legs work?", "Where can I find my lower legs?", "Where are the soleus?", "What are the soleus?", "How do the soleus work?", "Where can I find my soleus?", "Where are the gastrocnemius?", "What are the gastrocnemius?", "How do the gastrocnemius work?", "Where can I find my gastrocnemius?", "Where are the calves?", "What are the calves?", "How do the calves work?", "Where can I find my calves?", "Where is the abdomen?", "What's the abdomen?", "How does the abdomen work?", "Where can I find my abdomen?", "Where is the six-pack?", "What's the six-pack?", "How does the six-pack work?", "Where can I find my six-pack?", "Where is the stomach?", "What's the stomach?", "How does the stomach work?", "Where can I find my stomach?", "Where is the belly?", "What's the belly?", "How does the belly work?", "Where can I find my belly?", "Where is the gut?", "What's the gut?", "How does the gut work?", "Where can I find my gut?", "Where is the beer belly?", "What's the beer belly?", "How does the beer belly work?", "Where can I find my beer belly?", "Where are the rectus abdominis?", "What are the rectus abdominis?", "How do the rectus abdominis work?", "Where can I find my rectus abdominis?", "Where are the abs?", "What are the abs?", "How do the abs work?", "Where can I find my abs?", "Where are the external obliques?", "What are the external obliques?", "How do the external obliques work?", "Where can I find my external obliques?", "Where are the obliques?", "What are the obliques?", "How do the obliques work?", "Where can I find my obliques?", "Where are the legs?", "What are the legs?", "How do the legs work?", "Where can I find my legs?"], "responses": []}]}